[
  {
    "createdAt": {
      "_seconds": 1676404507,
      "_nanoseconds": 171000000
    },
    "timestamp": 1676404507,
    "author": "Peter Lewandowski",
    "title": "Hitchhikers Guide to the Macbook",
    "link": "https://medium.com/@peter-lewandowski/hitchhikers-guide-to-the-macbook-4964dff372dd",
    "body": "I was born a Windows kid.  Windows did everything better, according to a young and inexperienced Peter from the past. After experiencing the dark side… there is no going back.  Here are some cool tips and tricks I’ve learned since getting my first MacBook Pro in 2021.  Setting up & using your new Mac:  Enable Double Tap to Click Enable Auto-hide and Show the Dock Enable Minimize Windows in app icon (in Dock) Set up your NightShift Reduce Motion + Reduce Transparency (to speed up your mac) Set your screen brightness to manual control Show status/path/tab bars in Finder Place Applications folder in dock for easy access to a full list of apps Download Chrome Chrome: CMD + Up/down Arrow (Home/End of page) Chrome: Option+CMD+Left/Right Arrow (Switch between tabs quickly) Double Tap an app’s top bar to expand to full screen Double Tap an app’s top bar, open another window and position for split window view (no ‘Full Screen’ necessary) Enable “Use scroll gesture with modifier key to zoom” in System Preferences > Accessibility Use the “Control + Scroll up/down” to zoom in on the specific part of the screen Use Command+Tab (~) to switch between open applications Use Command + ~ to switch between windows of an open application Use the Window menu in the top bar to see a list of windows of the open application In the top menu bar, Use the [application name] > Quit [application name] to close an application for good (not just hide it) (I’ll keep updating this list as I go, so let’s consider this the first draft ;-)",
    "summary": "Tips and Tricks for New Macbook users",
    "id": "4IA89n28p5JnKl3RzdnN"
  },
  {
    "createdAt": {
      "_seconds": 1676402554,
      "_nanoseconds": 691000000
    },
    "title": "testing onSubmit",
    "body": "testing new onSubmit function with useRef to prevent constant re-rendering",
    "link": "n/a",
    "timestamp": 1676402554,
    "author": "Peter L",
    "summary": "testing new onSubmit function",
    "id": "CXA6pyczKniYbaqdEseO"
  },
  {
    "title": "hello",
    "body": "bootstrappin",
    "link": "this should be a link",
    "createdAt": {
      "_seconds": 1676415483,
      "_nanoseconds": 868000000
    },
    "timestamp": 1676415483,
    "summary": "Yo yo yoyoyo",
    "author": "Bridgette",
    "id": "T0I9OftkIk8UzY6gvd1U"
  },
  {
    "body": "useEffect(() => {     fetch(`${process.env.REACT_APP_API}/news`)       .then(response => response.json())       .then(data => {         data = data?.sort(( a: any, b: any) => b.timestamp - a.timestamp)         setAllNews(data)       })       .catch(err => console.log(err))   }, [newsArticleData])",
    "link": "",
    "title": "Testing re-render onSubmit",
    "summary": "Testing re-render of the onSubmit function",
    "createdAt": {
      "_seconds": 1676403924,
      "_nanoseconds": 951000000
    },
    "author": "Peter L",
    "timestamp": 1676403924,
    "id": "Vb4wuUw5dGxZmAcJD7a8"
  },
  {
    "createdAt": {
      "_seconds": 1657221460,
      "_nanoseconds": 365000000
    },
    "author": "Maria Bruno",
    "title": "Curls Gone Wild — My Final Project",
    "body": "I graduated from Boca Code on June 24th. The determinator for completing the program was choosing a problem and solving it by creating a web application. I started to ponder what issues I have seen in society, my life, and my family’s life. I can’t solve everyone’s problems but I can start by solving my own. Here begins the thinking that comes with being an engineer. What problem in my life can I solve with tech? I have to repeat one answer to a question AT LEAST on a weekly basis. “What do you put in your hair to make it look like that?”  The general problem is that the beauty standard and default hair type is straight hair, which means lots of topics have been researched and completed to gather vital information on styling, caring, and getting the best results for straight hair. This leads to a lack of information on other hair types, which means tons of experimenting, research, and waste of time & money.",
    "published": false,
    "timestamp": 1657221460,
    "id": "VqG8zjf9MRiUJm5DzIkk"
  },
  {
    "published": false,
    "timestamp": 1657221755,
    "author": "Arthur Silva",
    "body": "Studying is difficult. You may think it is simply sitting down and reading over some material. But if you have ever really tried, you might have realized that you found yourself reading the same page multiple times. You keep getting distracted- You don’t even remember what you read a minute ago. The key to solving this is to properly set yourself up for success and plan around your shortcomings, which everyone has. I will explain my steps for achieving this from the perspective of a software engineer. Hopefully, this will help you stop re-reading the same pages, in my case- the same lines of code.  The first step to help make studying easier on yourself is to switch up your studying environment. It is challenging to stay focused at home. There are an infinite number of distractions around you at any given time. You might even convince yourself that doing chores instead of studying is a better use of your time. It can’t be only me that thinks this way! Switching up your environment can be anything from leaving your room to going into your home office or going to a completely different location altogether. My favorite location is the library, where I can have peace and access to whiteboards. I have noticed that when I am in a different environment, my state of mind changes, and I feel more focused and motivated to study. If you work from home this may be the most crucial step. It can be hard to be productive at work in the same place you spend your free time.",
    "title": "Don’t make studying harder than it already is.",
    "createdAt": {
      "_seconds": 1657221755,
      "_nanoseconds": 71000000
    },
    "id": "Z99w3tproNOU05gVQEdJ"
  },
  {
    "title": "The Best Ways to Really Feel Comfortable as a Software Engineer",
    "createdAt": {
      "_seconds": 1657221271,
      "_nanoseconds": 82000000
    },
    "published": false,
    "body": "We do it all the time, and we don’t even realize how much we’re hurting ourselves in the long run. Since joining a Full-Stack Software Engineering course in the spring I never expected to know how important comfortability is. As shown in the image above, I feel like not just beginners, but also senior engineers tend to continuously make the mistake of straining their backs in the letter “C” position among also facing many other factors that can potentially hurt us. Between looking at code all day, or just trying to squeeze in last-minute projects we just drink coffee and forget these things even happen. ",
    "timestamp": 1657221271,
    "author": "Aneer Fidalgo",
    "id": "ZCqfqCKZ150ygXPiztpE"
  },
  {
    "published": false,
    "title": "Imposter Syndrome, have you heard of it?",
    "author": "Ludwigson Morisseau",
    "createdAt": {
      "_seconds": 1657221633,
      "_nanoseconds": 591000000
    },
    "timestamp": 1657221633,
    "body": "We’ve all heard whispers and rumors of the mysterious anguish affecting everyone in different aspects of their life. It can be fickle like a short fleeting breeze on a humid summer day or persists and surrounds you like a thick fog in the early morning. If you haven’t been able to guess I am referring to Imposter Syndrome, this affliction affects and shows up differently from person to person. Imposter Syndrome is psychologically defined as an individual who doubts their skills, talents, or accomplishments and has a persistent internalized fear of being exposed as a fraud; despite external evidence of their competence.",
    "id": "rlR5vdGn66YsYBPC0kiG"
  }
]
